# BaseHeatLoadOn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..BaseHeatLoadOn Property
Space Class See Also
---
The heat load-on.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public BaseLoadOn BaseHeatLoadOn { get; set; }
```

Visual Basic
---
```text
Public Property BaseHeatLoadOn As BaseLoadOn
	Get
	Set
```

Visual C++
---
```text
public:
property BaseLoadOn BaseHeatLoadOn {
	BaseLoadOn get ();
	void set (BaseLoadOn value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the values is not kUseDefaultLoad or kUseEnteredLoad. |

# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace